test_cases/test_column_blob_sigmaC/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// taken from blockMeshDict
box_h_center  #calc "${${FOAM_CASE}/system/blockMeshDict!box_width}*0.5";
drop_v_pos      #calc "${${FOAM_CASE}/system/blockMeshDict!box_height} - $box_h_center";

resistdrop_r    1.5e-3;

defaultFieldValues
(
    volScalarFieldValue alpha.water     1
    volScalarFieldValue alpha.resist    0
    volScalarFieldValue C               1
);

regions
(
    // resist droplet
    cylinderToCell
    {
        p1      ($box_h_center  -0.1    $drop_v_pos);
        p2      ($box_h_center  0.1     $drop_v_pos);
        radius  $resistdrop_r;
        fieldValues
        (
            volScalarFieldValue alpha.resist    1
            volScalarFieldValue alpha.water     0
            volScalarFieldValue C               1e-9
        );
    }
);


// ************************************************************************* //
